load-test/autocannon.txt
Running 20s test @ http://localhost:3000/98tOZuw3
10 connections with 2 pipelining factor
2 workers


┌─────────┬──────┬──────┬───────┬──────┬─────────┬─────────┬──────┐
│ Stat    │ 2.5% │ 50%  │ 97.5% │ 99%  │ Avg     │ Stdev   │ Max  │
├─────────┼──────┼──────┼───────┼──────┼─────────┼─────────┼──────┤
│ Latency │ 0 ms │ 0 ms │ 2 ms  │ 2 ms │ 0.12 ms │ 0.46 ms │ 9 ms │
└─────────┴──────┴──────┴───────┴──────┴─────────┴─────────┴──────┘
┌───────────┬─────────┬─────────┬────────┬─────────┬───────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%   │ Avg       │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼────────┼─────────┼───────────┼────────┼─────────┤
│ Req/Sec   │ 37,823  │ 37,823  │ 40,767 │ 41,183  │ 40,220.81 │ 994.96 │ 37,794  │
├───────────┼─────────┼─────────┼────────┼─────────┼───────────┼────────┼─────────┤
│ Bytes/Sec │ 10.2 MB │ 10.2 MB │ 11 MB  │ 11.1 MB │ 10.8 MB   │ 268 kB │ 10.2 MB │
└───────────┴─────────┴─────────┴────────┴─────────┴───────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 40

804k requests in 20.02s, 216 MB read

@nasir-PC MINGW64 /c/work/url-shortner (main)
$ autocannon -m GET -c 100 -d 20 -p 2 -w 2 "http://localhost:3000/98tOZuw3" 2>&1 | tee autocannon.txt
Running 20s test @ http://localhost:3000/98tOZuw3
100 connections with 2 pipelining factor
2 workers



Running 20s test @ http://localhost:3000/98tOZuw3
50 connections with 2 pipelining factor
2 workers


┌─────────┬──────┬──────┬───────┬───────┬─────────┬─────────┬────────┐
│ Stat    │ 2.5% │ 50%  │ 97.5% │ 99%   │ Avg     │ Stdev   │ Max    │
├─────────┼──────┼──────┼───────┼───────┼─────────┼─────────┼────────┤
│ Latency │ 0 ms │ 1 ms │ 9 ms  │ 11 ms │ 2.01 ms │ 2.58 ms │ 115 ms │
└─────────┴──────┴──────┴───────┴───────┴─────────┴─────────┴────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬──────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg      │ Stdev   │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼─────────┼────────┤
│ Req/Sec   │ 32,719 │ 32,719 │ 40,255  │ 41,215  │ 39,756.4 │ 1,816.6 │ 32,706 │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼─────────┼────────┤
│ Bytes/Sec │ 8.8 MB │ 8.8 MB │ 10.8 MB │ 11.1 MB │ 10.7 MB  │ 490 kB  │ 8.8 MB │
└───────────┴────────┴────────┴─────────┴─────────┴──────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 40

795k requests in 20.02s, 214 MB read